LEXICON_RU = {
    '/start': '''🌟 <b>Добро пожаловать в WishReserveBot!</b> 🌟

🎁 Создавайте списки желаний к любому поводу - на дни рождения, праздники или просто так!
🔒 Ваши друзья смогут тайно бронировать подарки, сохраняя сюрприз.

Дарите подарки с удовольствием! ✨''',

    '/help': '''🆘 <b>Нужна помощь?</b>

Мы всегда на связи! Обратитесь в поддержку по любым вопросам.''',
    'start_menu': '🏠 Главное меню',
    'btn_start': '🚀 Начать',
    'btn_support': '💬 Поддержка',
    'btn_go_back': '🔙 Назад',
    'btn_my_wishlists': '📋 Мои списки',
    'btn_friends_wishlists': "👯 Списки друзей",
    'btn_help': '❓ Помощь',
    'btn_create_wishlist': '✨ Новый список',

    'my_wishlists_if_none': '''📭 <b>Списков пока нет</b>

Создайте первый список желаний - это займет минуту!''',

    'my_wishlists': '''📚 <b>Ваши списки</b>

Нажмите на список, чтобы изменить или поделиться с друзьями.''',

    'friends_wishlists_if_none': '''👀 <b>Списков друзей нет</b>

Попросите друзей поделиться своими списками или помогите им создать первый!''',

    'friends_wishlists': '''🎯 <b>Списки друзей</b>

Тайно бронируйте подарки и делайте их дни особенными! Не видите нужный список? Попросите друга поделиться.''',
    'create_wishlist_title': '📝 Введите название вишлиста:',
    'create_wishlist_description': '✏️ Добавьте описание (необязательно):',
    'create_wishlist_date': '📅 Укажите дату события (если нужно):',
    'add_item_name': '🎁 Введите название подарка:',
    'add_item_description': '📌 Добавьте описание подарка:',
    'add_item_photo': '✏️ Добавьте подпись к фото (необязательно):',
    'add_item_price': '💵 Укажите примерную стоимость:',
    'add_item_link': '🔗 Прикрепите ссылку на товар (если есть):',
    'add_item_priority': '⭐ Выберите приоритет:',
    'priority_options': {
        'high': 'Очень хочу!',
        'medium': 'Было бы классно',
        'low': 'Если будет возможность'
    },
    'wishlist_created': '✅ Вишлист успешно создан!',
    'cancel_wishlist_creation': '❌ Отменить создание вишлиста',
    'confirm_cancel': '''⚠️ Вы уверены, что хотите отменить создание вишлиста?

Все введенные данные будут потеряны.''',
    'btn_confirm_cancel': '✔️ Да, отменить',
    'btn_continue_creation': '✖️ Нет, продолжить'
}
