LEXICON_RU = {
    '/start': '''🌟 <b>Добро пожаловать в WishReserveBot!</b> 🌟

🎁 Создавайте списки желаний для любых событий!
🔒 Друзья смогут незаметно бронировать подарки.

Начните прямо сейчас! ✨''',

    '/help': '''🆘 <b>Нужна помощь?</b>

Наша поддержка работает круглосуточно.''',

    'start_menu': '🏠 Главное меню',
    'btn_start': '🚀 Начать',
    'btn_support': '💬 Поддержка',
    'btn_go_back': '↩ Назад',
    'btn_my_wishlists': '📋 Мои списки желаний',
    'btn_friends_wishlists': "👯 Списки желаний друзей",
    'btn_help': '❓ Помощь',
    'btn_create_wishlist': '➕ Новый список',

    'my_wishlists_if_none': '''📭 <b>Списков пока нет</b>

Создайте первый список желаний за минуту!''',

    'my_wishlists': '''📚 <b>Ваши списки желаний</b>

Нажмите для управления''',

    'friends_wishlists_if_none': '''👀 <b>Нет доступных списков желаний</b>

Попросите друзей поделиться''',

    'friends_wishlists': '''🎯 <b>Списки друзей</b>

Тайно бронируйте подарки!''',

    'create_wishlist_title': '✏️ Название списка (4-50 знаков):',
    'create_wishlist_description': '📝 Описание (необязательно, /skip чтобы пропустить):',
    'create_wishlist_date': '📅 Дата события (ДД.ММ.ГГГГ или /skip):',
    'wishlist_created': '''✅ <b>Список успешно создан!</b>

🎯 <b>Название:</b> {title}
📝 <b>Описание:</b> {description}
📅 <b>Дата:</b> {date}''',
    'not_specified': 'Не указано',
    'cancel_wishlist_creation': '❌ Отмена',
    'canceled_wishlist_creation': 'ℹ️ Создание отменено',

    # Добавление подарка
    'add_item_name': '🎁 Название:',
    'add_item_description': '📌 Описание (необязательно):',
    'add_item_photo': '📸 Фото (необязательно):',
    'add_item_price': '💲 Примерная цена:',
    'add_item_link': '🔗 Ссылка на товар:',
    'add_item_priority': '⭐ Приоритет:',

    'priority_options': {
        'high': 'Очень хочу',
        'medium': 'Было бы хорошо',
        'low': 'Если получится'
    },

    # Сообщения валидации
    'invalid_title_length': "⚠ От 4 до 50 символов",
    'invalid_description_length': "⚠ Не более 300 знаков",
    'empty_date_error': "⚠ Укажите дату",
    'invalid_date_format': "⚠ Формат ДД.ММ.ГГГГ",
    'date_in_past_error': "⚠ Дата в прошлом",

     'my_wishlists': "📋 Ваши вишлисты (всего: {count}):",
    'my_wishlists_if_none': "У вас пока нет вишлистов. Хотите создать первый?",
    'friends_wishlists': "🎁 Вишлисты ваших друзей (всего: {count}):",
    'friends_wishlists_if_none': "У ваших друзей пока нет вишлистов или они не поделились с вами.",
}
